/**************************************************
 * MKOnlinePlayer v2.32
 * 播放列表配置模块
 * 编写：mengkun(http://mkblog.cn)
 * 时间：2017-9-15
 *************************************************/
// 建议修改前先备份一下
// 获取 歌曲的网易云音乐ID 或 网易云歌单ID 的方法：
// 先在 js/player.js 中开启调试模式，然后按 F12 打开浏览器的控制台。播放歌曲或点开歌单即可看到相应信息

var musicList = [
    // 以下三个系统预留列表请勿更改，否则可能导致程序无法正常运行！
    // 预留列表：搜索结果
    {
        name: "搜索结果",   // 播放列表名字
        cover: "",          // 播放列表封面
        creatorName: "",        // 列表创建者名字
        creatorAvatar: "",      // 列表创建者头像
        item: []
    },
    // 预留列表：正在播放
    {
        name: "正在播放",   // 播放列表名字
        cover: "",          // 播放列表封面
        creatorName: "",        // 列表创建者名字
        creatorAvatar: "",      // 列表创建者头像
        item: []
    },
    // 预留列表：播放历史
    {
        name: "播放历史",   // 播放列表名字
        cover: "images/history.png",          // 播放列表封面
        creatorName: "",        // 列表创建者名字
        creatorAvatar: "",      // 列表创建者头像
        item: []
    },  
    // 以上三个系统预留列表请勿更改，否则可能导致程序无法正常运行！
    //*********************************************
    // 自定义列表开始，您可以自由添加您的自定义列表
    {
        id: 3778678     // 云音乐热歌榜
    },
    {
        id: 3779629     // 云音乐新歌榜
    },
    {
        id: 4395559     // 华语金曲榜
    },
    {
        id: 64016     // 中国TOP排行榜（内地榜）
    },
    {
        id: 112504     // 中国TOP排行榜（港台榜）
    },
    {
        id: 19723756     // 云音乐飙升榜
    },
    {
        id: 2884035     // "网易原创歌曲榜"
    },
    {   id: 60198      }, // "美国Billboard榜"
    {   id: 180106      }, // "UK排行榜周榜"
    {   id: 21845217      }, // "KTV唛榜"
    {   id: 0      }, 
    {   id: 0      }, 
    {   id: 0      }, 
    {   id: 0      }, 
    {   id: 0      }, 
    {   id: 0      }, 
    {   id: 0      }, 
    {   id: 0      }, 
    {   id: 0      }, 
    {   id: 0      }, 
    {   id: 0      }, 
    {   id: 0      }, 
    {   id: 0      }, 
    {   id: 0      }, 
    {   id: 0      }, 
    {   id: 0      }, 
    {   id: 0      }, 
    {   id: 0      }, 
    {   id: 0      }, 
    {   id: 0      }, 
    {   id: 0      }, 
    {   id: 0      }, 
    {   id: 0      }, 
    {   id: 0      }, 
    {   id: 0      }, 
    {   id: 0      }, 
    {   id: 0      }, 
    {   id: 0      }, 
    {   id: 0      }, 
    {   id: 0      }, 
    {   id: 0      }, 
    {   id: 0      } 

    // {   id: 2148882530      }, 
    // {   id: 7677040115      }, 
    // {   id: 7734298090      }, 
    // {   id: 7791887875      }, 
    // {   id: 5199155506      }, 
    // {   id: 7662511571      }, 
    // {   id: 7662651829      }, 
    // {   id: 7662645770      }, 
    // {   id: 7662308881      }, 
    // {   id: 7662689703      }, 
    // {   id: 6948039584      }, 
    // {   id: 5212729721      } 

];



var artistList = [
	10559,6469,6460,6454,
    2116,7224,7439,12382970,
	3683,3689,8331,8353,
	3684,3692,8336,8354,
	1875,1876,2110,2747,
	7763,
    12676697,
    10562,
	5358,
	2738,
	6066,
	6068,
	6454,
	6652,
	980025,
	9275
];

var albumList = [
];